package hw7;

/*
Работаем с проектом из Урока 3

1.      Создать прокси для класса mathBox (подумайте, что для этого надо добавить к классу)

2.      В вызов методов класса через прокси добавить логирование в консоль при использовании аннотации Logged

3.      В вызов методов класса через прокси добавить очистку поля-контейнера при использовании аннотации ClearData у вызванного метода

Нужные аннотации добавить к проекту


Дополнительное задание (не на оценку)

Добавить в проект сериализации объект-прокси, который будет при использовании аннотации UseXml выполнять сериализацию-десериализацию в XML вместо нативной. Саму сериализацию-десериализацию можно заглушить. Главное разобраться с прокси и созданием собственных аннотаций.

 */

public class Main {

}
